tlondero/LaboDeMicrosTPF/App/MP3Player/board/pin_mux.c
	/* Drive Strength Enable: Low drive strength is configured on the corresponding pin, if pin
	 * is configured as a digital output. */
	| PORT_PCR_DSE(kPORT_LowDriveStrength));

	const port_pin_config_t portd0_pin93_config = {/* Internal pull-down resistor is enabled */
	kPORT_PullDown,
	/* Fast slew rate is configured */
	kPORT_FastSlewRate,
	/* Passive filter is disabled */
	kPORT_PassiveFilterDisable,
	/* Open drain is disabled */
	kPORT_OpenDrainDisable,
	/* Low drive strength is configured */
	kPORT_LowDriveStrength,
	/* Pin is configured as PTD0 */
	kPORT_MuxAsGpio,
	/* Pin Control Register fields [15:0] are not locked */
	kPORT_UnlockRegister };
	/* PORTD0 (pin 93) is configured as PTD0 */
	PORT_SetPinConfig(PORTD, PIN0_IDX, &portd0_pin93_config);

	const port_pin_config_t portd0_pin94_config = {/* Internal pull-down resistor is enabled */
	kPORT_PullDown,
	/* Fast slew rate is configured */
	kPORT_FastSlewRate,
	/* Passive filter is disabled */
	kPORT_PassiveFilterDisable,
	/* Open drain is disabled */
	kPORT_OpenDrainDisable,
	/* Low drive strength is configured */
	kPORT_LowDriveStrength,
	/* Pin is configured as PTD0 */
	kPORT_MuxAsGpio,
	/* Pin Control Register fields [15:0] are not locked */
	kPORT_UnlockRegister };
	/* PORTD0 (pin 94) is configured as PTD0 */
	PORT_SetPinConfig(PORTD, PIN1_IDX, &portd0_pin94_config);

	const port_pin_config_t portd0_pin95_config = {/* Internal pull-down resistor is enabled */
	kPORT_PullDown,
	/* Fast slew rate is configured */
	kPORT_FastSlewRate,
	/* Passive filter is disabled */
	kPORT_PassiveFilterDisable,
	/* Open drain is disabled */
	kPORT_OpenDrainDisable,
	/* Low drive strength is configured */
	kPORT_LowDriveStrength,
	/* Pin is configured as PTD0 */
	kPORT_MuxAsGpio,
	/* Pin Control Register fields [15:0] are not locked */
	kPORT_UnlockRegister };
	/* PORTD0 (pin 95) is configured as PTD0 */
	PORT_SetPinConfig(PORTD, PIN2_IDX, &portd0_pin95_config);

	const port_pin_config_t portc1_pin71_config = {/* Internal pull-down resistor is enabled */
	kPORT_PullDisable,
	/* Fast slew rate is configured */
	kPORT_FastSlewRate,
	/* Passive filter is disabled */
	kPORT_PassiveFilterDisable,
	/* Open drain is disabled */
	kPORT_OpenDrainDisable,
	/* Low drive strength is configured */
	kPORT_HighDriveStrength,
	/* Pin is configured as PTD0 */
	kPORT_MuxAlt4,
	/* Pin Control Register fields [15:0] are not locked */
	kPORT_UnlockRegister };
	/* PORTD0 (pin 96) is configured as PTD0 */
	PORT_SetPinConfig(PORTC, PIN1_IDX, &portc1_pin71_config);

	SIM->SOPT5 = ((SIM->SOPT5 & (~(SIM_SOPT5_UART0TXSRC_MASK))) /* Mask bits to zero which are setting */
	| SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX) /* UART 0 transmit data source select: UART0_TX pin */
	);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitButtonsPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '78', peripheral: GPIOC, signal: 'GPIO, 6', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/I2S0_RX_BCLK/FB_AD9/I2S0_MCLK, identifier: SW2,
    direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: up, pull_enable: enable,
    passive_filter: disable}
  - {pin_num: '38', peripheral: GPIOA, signal: 'GPIO, 4', pin_signal: PTA4/LLWU_P3/FTM0_CH1/NMI_b/EZP_CS_b, direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitButtonsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitButtonsPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t SW3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA4 (pin 38)  */
    GPIO_PinInit(BOARD_SW3_GPIO, BOARD_SW3_PIN, &SW3_config);

    gpio_pin_config_t SW2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC6 (pin 78)  */
    GPIO_PinInit(BOARD_SW2_GPIO, BOARD_SW2_PIN, &SW2_config);

    const port_pin_config_t SW3 = {/* Internal pull-up/down resistor is disabled */
                                   kPORT_PullDisable,
                                   /* Fast slew rate is configured */
                                   kPORT_FastSlewRate,
                                   /* Passive filter is disabled */
                                   kPORT_PassiveFilterDisable,
                                   /* Open drain is disabled */
                                   kPORT_OpenDrainDisable,
                                   /* Low drive strength is configured */
                                   kPORT_LowDriveStrength,
                                   /* Pin is configured as PTA4 */
                                   kPORT_MuxAsGpio,
                                   /* Pin Control Register fields [15:0] are not locked */
                                   kPORT_UnlockRegister};
    /* PORTA4 (pin 38) is configured as PTA4 */
    PORT_SetPinConfig(BOARD_SW3_PORT, BOARD_SW3_PIN, &SW3);

    /* Interrupt configuration on PORTA4 (pin 38): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_SW3_PORT, BOARD_SW3_PIN, kPORT_InterruptFallingEdge);

    const port_pin_config_t SW2 = {/* Internal pull-up resistor is enabled */
                                   kPORT_PullUp,
                                   /* Fast slew rate is configured */
                                   kPORT_FastSlewRate,
                                   /* Passive filter is disabled */
                                   kPORT_PassiveFilterDisable,
                                   /* Open drain is disabled */
                                   kPORT_OpenDrainDisable,
                                   /* Low drive strength is configured */
                                   kPORT_LowDriveStrength,
                                   /* Pin is configured as PTC6 */
                                   kPORT_MuxAsGpio,
                                   /* Pin Control Register fields [15:0] are not locked */
                                   kPORT_UnlockRegister};
    /* PORTC6 (pin 78) is configured as PTC6 */
    PORT_SetPinConfig(BOARD_SW2_PORT, BOARD_SW2_PIN, &SW2);

    /* Interrupt configuration on PORTC6 (pin 78): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_SW2_PORT, BOARD_SW2_PIN, kPORT_InterruptFallingEdge);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '67', peripheral: GPIOB, signal: 'GPIO, 21', pin_signal: PTB21/SPI2_SCK/FB_AD30/CMP1_OUT, direction: OUTPUT, gpio_init_state: 'true', slew_rate: slow,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
  - {pin_num: '68', peripheral: GPIOB, signal: 'GPIO, 22', pin_signal: PTB22/SPI2_SOUT/FB_AD29/CMP2_OUT, direction: OUTPUT, gpio_init_state: 'true', slew_rate: slow,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
  - {pin_num: '33', peripheral: GPIOE, signal: 'GPIO, 26', pin_signal: PTE26/ENET_1588_CLKIN/UART4_CTS_b/RTC_CLKOUT/USB_CLKIN, direction: OUTPUT, gpio_init_state: 'true',
    slew_rate: slow, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

